Podkova/src/AccumulationRegisters/ДенежныеСредстваВКассахККМ/ДенежныеСредстваВКассахККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваВКассахККМ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьКПоступлениюВКассуККМ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьКПоступлениюВКассуОрганизации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Podkova/src/Enums/ОперацииЗакрытияМесяца/ОперацииЗакрытияМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииЗакрытияМесяца</name>
  <enumValues>
    <name>АннулированиеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовУчетаДоходовИРасходовМУ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеДублейВидовЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОтрицательныхОстатковТоваровОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокВИсходныхДанных</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииНМА</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОС</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОСиНМАМеждународныйУчет</name>
  </enumValues>
  <enumValues>
    <name>НачислениеОценочныхОбязательствРезервовПоОтпускам</name>
  </enumValues>
  <enumValues>
    <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачисленияПоКредитамДепозитамИВыданнымЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВРегламентированномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеЗарплатыВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыкупаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыработкиСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковТоваровКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовКомитентамОСписании</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовПоКомиссииМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПроизводстваБезЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСчетовФактурИТаможенныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаДвиженийПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаДенежныхСредствИФинансовыхИнструментов</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаНовыеРежимыУчета</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаУчетВнеоборотныхАктивовВерсии24</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНДСВБюджетПоОтдельнымОперациям</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеПроизводстваПродукцииБезСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНалоговомУчетеЛизинговыхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеДоходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции21</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции22</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеНДС</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВВалютеПредставления</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВФункциональнойВалюте</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетПартийИСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>РасчетСтоимостиВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗатратНаВыпускБезРаспоряжений</name>
  </enumValues>
  <enumValues>
    <name>СторноДоходовКУДиР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАмортизацияОС</name>
    <comment>Использовалось до версии 2.4</comment>
  </enumValues>
  <enumValues>
    <name>УстановкаДатыЗапретаФормированияПроводокМУ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоВнеоборотнымАктивам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеДокументовРаспределенияРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеСводныхСправокНДС</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНалоговВСвязиСКоронавирусом</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/AccumulationRegisters/ДенежныеСредстваВКассахККМ/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ДополнительныеСвойства.Свойство("ДляПроведения")
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
	ДополнительныеСвойства.ДляПроведения.Вставить("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	
	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Записи.Период                        КАК Период,
	|	Записи.Регистратор                   КАК Регистратор,
	|	Записи.Организация                   КАК Организация,
	|	Записи.КассаККМ                      КАК Касса,
	|
	|	Записи.Сумма                         КАК Сумма,
	|	Записи.СуммаУпр                      КАК СуммаУпр,
	|	Записи.СуммаРегл                     КАК СуммаРегл
	|
	|ПОМЕСТИТЬ ДенежныеСредстваВКассахККМПередЗаписью
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ КАК Записи
	|ГДЕ
	|	Записи.Регистратор = &Регистратор
	|	И (ТипЗначения(Записи.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр
	|		ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегл
	|	)
	|");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ВалютаУпр", ДополнительныеСвойства.ДляПроведения.ВалютаУпр);
	Запрос.УстановитьПараметр("ВалютаРегл", ДополнительныеСвойства.ДляПроведения.ВалютаРегл);
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	// Вместо ОбменДанными.Загрузка используется ДополнительныеСвойства.Свойство("ДляПроведения").
	// Данное свойство устанавливается в модуле ПроведениеСервер при интерактивном проведении документа.
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения") ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК МЕСЯЦ,
	|	Таблица.Организация                  КАК Организация,
	|	&Операция                            КАК Операция,
	|	Таблица.Регистратор                  КАК Документ
	|ПОМЕСТИТЬ ДенежныеСредстваВКассахККМЗаданияКЗакрытиюМесяца
	|ИЗ
	|	(ВЫБРАТЬ
	|		Записи.Период                        КАК Период,
	|		Записи.Регистратор                   КАК Регистратор,
	|		Записи.Организация                   КАК Организация,
	|		Записи.Касса                         КАК Касса,
	|
	|		Записи.Сумма                         КАК Сумма,
	|		Записи.СуммаУпр                      КАК СуммаУпр,
	|		Записи.СуммаРегл                     КАК СуммаРегл
	|	ИЗ
	|		ДенежныеСредстваВКассахККМПередЗаписью КАК Записи
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Записи.Период                         КАК Период,
	|		Записи.Регистратор                    КАК Регистратор,
	|		Записи.Организация                    КАК Организация,
	|		Записи.КассаККМ                       КАК Касса,
	|
	|		-Записи.Сумма                         КАК Сумма,
	|		-Записи.СуммаУпр                      КАК СуммаУпр,
	|		-Записи.СуммаРегл                     КАК СуммаРегл
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ КАК Записи
	|	ГДЕ
	|		Записи.Регистратор = &Регистратор
	|		И (ТипЗначения(Записи.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|			ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр
	|			ИЛИ Записи.КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегл)
	|	) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ),
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.Касса
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.Сумма) <> 0
	|	ИЛИ СУММА(Таблица.СуммаУпр) <> 0
	|	ИЛИ СУММА(Таблица.СуммаРегл) <> 0
	|");
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов);
	Запрос.УстановитьПараметр("ВалютаУпр", ДополнительныеСвойства.ДляПроведения.ВалютаУпр);
	Запрос.УстановитьПараметр("ВалютаРегл", ДополнительныеСвойства.ДляПроведения.ВалютаРегл);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
